# Current Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManagerIterator..::..Current Property
MacroManagerIterator Class See Also
---
Gets the item at the current position of the iterator.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual MacroModule Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As MacroModule
	Get
```

Visual C++
---
```text
public:
virtual property MacroModule^ Current {
	MacroModule^ get ();
}
```

# ### Implements
IEnumerator<(Of <(<'T>)>)>..::..Current
# Remarks
There is no current item if the iterator has not started yet or has been done.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
MacroManagerIterator Class
Autodesk.Revit.DB.Macros Namespace